OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf1330.h
/*
 * This declarations of the PIC18LF1330 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:59 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC18LF1330_H__
#define __PIC18LF1330_H__

//==============================================================================

//==============================================================================
//
//	Register Definitions
//
//==============================================================================


//==============================================================================
//        PORTA Bits

extern __at(0x0F80) __sfr PORTA;

typedef union
  {
  struct
    {
    unsigned RA0                : 1;
    unsigned RA1                : 1;
    unsigned RA2                : 1;
    unsigned RA3                : 1;
    unsigned RA4                : 1;
    unsigned RA5                : 1;
    unsigned RA6                : 1;
    unsigned RA7                : 1;
    };

  struct
    {
    unsigned AN0                : 1;
    unsigned AN1                : 1;
    unsigned TX                 : 1;
    unsigned RX                 : 1;
    unsigned AN2                : 1;
    unsigned MCLR               : 1;
    unsigned OSC2               : 1;
    unsigned OSC1               : 1;
    };

  struct
    {
    unsigned INT0               : 1;
    unsigned INT1               : 1;
    unsigned CK                 : 1;
    unsigned                    : 1;
    unsigned T0CKI              : 1;
    unsigned NOT_MCLR           : 1;
    unsigned CLKO               : 1;
    unsigned CLKI               : 1;
    };

  struct
    {
    unsigned KBI0               : 1;
    unsigned KBI1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned VREFP              : 1;
    unsigned                    : 1;
    unsigned T1OSO              : 1;
    unsigned T1OSI              : 1;
    };

  struct
    {
    unsigned CMP0               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned AN3                : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T1CKI              : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned INT                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned KBI                : 2;
    unsigned                    : 6;
    };
  } __PORTAbits_t;

extern __at(0x0F80) volatile __PORTAbits_t PORTAbits;

#define _PORTA_RA0              0x01
#define _PORTA_AN0              0x01
#define _PORTA_INT0             0x01
#define _PORTA_KBI0             0x01
#define _PORTA_CMP0             0x01
#define _PORTA_RA1              0x02
#define _PORTA_AN1              0x02
#define _PORTA_INT1             0x02
#define _PORTA_KBI1             0x02
#define _PORTA_RA2              0x04
#define _PORTA_TX               0x04
#define _PORTA_CK               0x04
#define _PORTA_RA3              0x08
#define _PORTA_RX               0x08
#define _PORTA_RA4              0x10
#define _PORTA_AN2              0x10
#define _PORTA_T0CKI            0x10
#define _PORTA_VREFP            0x10
#define _PORTA_RA5              0x20
#define _PORTA_MCLR             0x20
#define _PORTA_NOT_MCLR         0x20
#define _PORTA_RA6              0x40
#define _PORTA_OSC2             0x40
#define _PORTA_CLKO             0x40
#define _PORTA_T1OSO            0x40
#define _PORTA_AN3              0x40
#define _PORTA_T1CKI            0x40
#define _PORTA_RA7              0x80
#define _PORTA_OSC1             0x80
#define _PORTA_CLKI             0x80
#define _PORTA_T1OSI            0x80

//==============================================================================


//==============================================================================
//        PORTB Bits

extern __at(0x0F81) __sfr PORTB;

typedef union
  {
  struct
    {
    unsigned RB0                : 1;
    unsigned RB1                : 1;
    unsigned RB2                : 1;
    unsigned RB3                : 1;
    unsigned RB4                : 1;
    unsigned RB5                : 1;
    unsigned RB6                : 1;
    unsigned RB7                : 1;
    };

  struct
    {
    unsigned PWM0               : 1;
    unsigned PWM1               : 1;
    unsigned INT2               : 1;
    unsigned INT3               : 1;
    unsigned PWM2               : 1;
    unsigned PWM3               : 1;
    unsigned PWM4               : 1;
    unsigned PWM5               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned KBI2               : 1;
    unsigned KBI3               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PGC                : 1;
    unsigned PGD                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CMP2               : 1;
    unsigned CMP1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T1OSO              : 1;
    unsigned T1OSI              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T1CKI              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PORTBbits_t;

extern __at(0x0F81) volatile __PORTBbits_t PORTBbits;

#define _PORTB_RB0              0x01
#define _PORTB_PWM0             0x01
#define _PORTB_RB1              0x02
#define _PORTB_PWM1             0x02
#define _PORTB_RB2              0x04
#define _PORTB_INT2             0x04
#define _PORTB_KBI2             0x04
#define _PORTB_CMP2             0x04
#define _PORTB_T1OSO            0x04
#define _PORTB_T1CKI            0x04
#define _PORTB_RB3              0x08
#define _PORTB_INT3             0x08
#define _PORTB_KBI3             0x08
#define _PORTB_CMP1             0x08
#define _PORTB_T1OSI            0x08
#define _PORTB_RB4              0x10
#define _PORTB_PWM2             0x10
#define _PORTB_RB5              0x20
#define _PORTB_PWM3             0x20
#define _PORTB_RB6              0x40
#define _PORTB_PWM4             0x40
#define _PORTB_PGC              0x40
#define _PORTB_RB7              0x80
#define _PORTB_PWM5             0x80
#define _PORTB_PGD              0x80

//==============================================================================


//==============================================================================
//        OVDCONS Bits

extern __at(0x0F82) __sfr OVDCONS;

typedef union
  {
  struct
    {
    unsigned POUT0              : 1;
    unsigned POUT1              : 1;
    unsigned POUT2              : 1;
    unsigned POUT3              : 1;
    unsigned POUT4              : 1;
    unsigned POUT5              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned POUT               : 6;
    unsigned                    : 2;
    };
  } __OVDCONSbits_t;

extern __at(0x0F82) volatile __OVDCONSbits_t OVDCONSbits;

#define _POUT0                  0x01
#define _POUT1                  0x02
#define _POUT2                  0x04
#define _POUT3                  0x08
#define _POUT4                  0x10
#define _POUT5                  0x20

//==============================================================================


//==============================================================================
//        OVDCOND Bits

extern __at(0x0F83) __sfr OVDCOND;

typedef union
  {
  struct
    {
    unsigned POVD0              : 1;
    unsigned POVD1              : 1;
    unsigned POVD2              : 1;
    unsigned POVD3              : 1;
    unsigned POVD4              : 1;
    unsigned POVD5              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned POVD               : 6;
    unsigned                    : 2;
    };
  } __OVDCONDbits_t;

