OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf1330.h
#define _OSC_LP_1H              0xF0    // LP Oscillator.
#define _OSC_XT_1H              0xF1    // XT Oscillator.
#define _OSC_HS_1H              0xF2    // HS Oscillator.
#define _OSC_RC_1H              0xF3    // External RC oscillator, CLKO function on RA6.
#define _OSC_EC_1H              0xF4    // EC oscillator, CLKO function on RA6.
#define _OSC_ECIO_1H            0xF5    // EC oscillator, port function on RA6.
#define _OSC_HSPLL_1H           0xF6    // HS oscillator, PLL enabled (Clock Frequency = 4 x FOSC1).
#define _OSC_RCIO_1H            0xF7    // External RC oscillator, port function on RA6.
#define _OSC_INTIO2_1H          0xF8    // Internal oscillator, port function on RA6 and RA7.
#define _OSC_INTIO1_1H          0xF9    // Internal oscillator, CLKO function on RA6, port function on RA7.
#define _FCMEN_OFF_1H           0xBF    // Fail-Safe Clock Monitor disabled.
#define _FCMEN_ON_1H            0xFF    // Fail-Safe Clock Monitor enabled.
#define _IESO_OFF_1H            0x7F    // Oscillator Switchover mode disabled.
#define _IESO_ON_1H             0xFF    // Oscillator Switchover mode enabled.

//----------------------------- CONFIG2L Options -------------------------------

#define _PWRT_ON_2L             0xFE    // PWRT enabled.
#define _PWRT_OFF_2L            0xFF    // PWRT disabled.
#define _BOR_OFF_2L             0xF9    // Brown-out Reset disabled in hardware and software.
#define _BOR_SBORENCTRL_2L      0xFB    // Brown-out Reset enabled and controlled by software (SBOREN is enabled).
#define _BOR_BOACTIVE_2L        0xFD    // Brown-out Reset enabled in hardware only and disabled in Sleep mode (SBOREN is disabled).
#define _BOR_BOHW_2L            0xFF    // Brown-out Reset enabled in hardware only (SBOREN is disabled).
#define _BORV_0_2L              0xE7    // Maximum setting.
#define _BORV_1_2L              0xEF    
#define _BORV_2_2L              0xF7    
#define _BORV_3_2L              0xFF    // Minimum setting.

//----------------------------- CONFIG2H Options -------------------------------

#define _WDT_OFF_2H             0xFE    // WDT disabled (control is placed on the SWDTEN bit).
#define _WDT_ON_2H              0xFF    // WDT enabled.
#define _WDTPS_1_2H             0xE1    // 1:1.
#define _WDTPS_2_2H             0xE3    // 1:2.
#define _WDTPS_4_2H             0xE5    // 1:4.
#define _WDTPS_8_2H             0xE7    // 1:8.
#define _WDTPS_16_2H            0xE9    // 1:16.
#define _WDTPS_32_2H            0xEB    // 1:32.
#define _WDTPS_64_2H            0xED    // 1:64.
#define _WDTPS_128_2H           0xEF    // 1:128.
#define _WDTPS_256_2H           0xF1    // 1:256.
#define _WDTPS_512_2H           0xF3    // 1:512.
#define _WDTPS_1024_2H          0xF5    // 1:1024.
#define _WDTPS_2048_2H          0xF7    // 1:2048.
#define _WDTPS_4096_2H          0xF9    // 1:4096.
#define _WDTPS_8192_2H          0xFB    // 1:8192.
#define _WDTPS_16384_2H         0xFD    // 1:16384.
#define _WDTPS_32768_2H         0xFF    // 1:32768.

//----------------------------- CONFIG3L Options -------------------------------

#define _PWMPIN_ON_3L           0xFD    // PWM outputs drive active states upon Reset.
#define _PWMPIN_OFF_3L          0xFF    // PWM outputs disabled upon Reset.
#define _LPOL_LOW_3L            0xFB    // PWM0, PWM2 and PWM4 are active-low.
#define _LPOL_HIGH_3L           0xFF    // PWM0, PWM2 and PWM4 are active-high (default).
#define _HPOL_LOW_3L            0xF7    // PWM1, PWM3 and PWM5 are active-low.
#define _HPOL_HIGH_3L           0xFF    // PWM1, PWM3 and PWM5 are active-high (default).

//----------------------------- CONFIG3H Options -------------------------------

#define _FLTAMX_RA7_3H          0xFE    // FLTA input is muxed onto RA7.
#define _FLTAMX_RA5_3H          0xFF    // FLTA input is muxed onto RA5.
#define _T1OSCMX_LOW_3H         0xF7    // T1OSO/T1CKI pin resides on RB2.
#define _T1OSCMX_HIGH_3H        0xFF    // T1OSO/T1CKI pin resides on RA6.
#define _MCLRE_OFF_3H           0x7F    // RA5 input pin enabled, MCLR pin disabled.
#define _MCLRE_ON_3H            0xFF    // MCLR pin enabled, RA5 input pin disabled.

//----------------------------- CONFIG4L Options -------------------------------

#define _STVREN_OFF_4L          0xFE    // Reset on stack overflow/underflow disabled.
#define _STVREN_ON_4L           0xFF    // Reset on stack overflow/underflow enabled.
#define _BBSIZ_BB256_4L         0xCF    // 256 Words (512 Bytes) Boot Block size.
#define _BBSIZ_BB512_4L         0xDF    // 512 Words (1024 Bytes) Boot Block size.
#define _BBSIZ_BB1K_4L          0xFF    // 1K Words (2048 Bytes) Boot Block size.
#define _XINST_OFF_4L           0xBF    // Instruction set extension and Indexed Addressing mode disabled.
#define _XINST_ON_4L            0xFF    // Instruction set extension and Indexed Addressing mode enabled.
#define _DEBUG_ON_4L            0x7F    // Background debugger enabled, RB6 and RB7 are dedicated to In-Circuit Debug.
#define _DEBUG_OFF_4L           0xFF    // Background debugger disabled, RB6 and RB7 configured as general purpose I/O pins.

//----------------------------- CONFIG5L Options -------------------------------

#define _CP0_ON_5L              0xFE    // Block 0 is code-protected.
#define _CP0_OFF_5L             0xFF    // Block 0 is not code-protected.
#define _CP1_ON_5L              0xFD    // Block 1 is code-protected.
#define _CP1_OFF_5L             0xFF    // Block 1 is not code-protected.

//----------------------------- CONFIG5H Options -------------------------------

#define _CPB_ON_5H              0xBF    // Boot Block is code-protected.
#define _CPB_OFF_5H             0xFF    // Boot Block is not code-protected.
#define _CPD_ON_5H              0x7F    // Data EEPROM is code-protected.
#define _CPD_OFF_5H             0xFF    // Data EEPROM is not code-protected.

//----------------------------- CONFIG6L Options -------------------------------

#define _WRT0_ON_6L             0xFE    // Block 0 is write-protected.
#define _WRT0_OFF_6L            0xFF    // Block 0 is not write-protected.
#define _WRT1_ON_6L             0xFD    // Block 1 is write-protected.
#define _WRT1_OFF_6L            0xFF    // Block 1 is not write-protected.

//----------------------------- CONFIG6H Options -------------------------------

#define _WRTC_ON_6H             0xDF    // Configuration registers are write-protected.
#define _WRTC_OFF_6H            0xFF    // Configuration registers are not write-protected.
#define _WRTB_ON_6H             0xBF    // Boot Block is write-protected.
#define _WRTB_OFF_6H            0xFF    // Boot Block is not write-protected.
#define _WRTD_ON_6H             0x7F    // Data EEPROM is write-protected.
#define _WRTD_OFF_6H            0xFF    // Data EEPROM is not write-protected.

//----------------------------- CONFIG7L Options -------------------------------

#define _EBTR0_ON_7L            0xFE    // Block 0 is protected from table reads executed in other blocks.
#define _EBTR0_OFF_7L           0xFF    // Block 0 is not protected from table reads executed in other blocks.
#define _EBTR1_ON_7L            0xFD    // Block 1 is protected from table reads executed in other blocks.
#define _EBTR1_OFF_7L           0xFF    // Block 1 is not protected from table reads executed in other blocks.

//----------------------------- CONFIG7H Options -------------------------------

#define _EBTRB_ON_7H            0xBF    // Boot Block is protected from table reads executed in other blocks.
#define _EBTRB_OFF_7H           0xFF    // Boot Block is not protected from table reads executed in other blocks.

//==============================================================================

#define __DEVID1                0x3FFFFE
#define __DEVID2                0x3FFFFF

#define __IDLOC0                0x200000
#define __IDLOC1                0x200001
#define __IDLOC2                0x200002
#define __IDLOC3                0x200003
#define __IDLOC4                0x200004
#define __IDLOC5                0x200005
#define __IDLOC6                0x200006
#define __IDLOC7                0x200007

#endif // #ifndef __PIC18LF1330_H__
